brew "git" # real binary; bypasses the slow /usr/bin/git Xcode shim
brew "neovim"
brew "tmux"
brew "direnv"
brew "asdf"
brew "fzf"
brew "zoxide"
brew "bat"
brew "glow" # render markdown in the terminal
brew "eza"
brew "ripgrep"
brew "dotnet"
brew "overmind"
brew "pnpm"
brew "googleworkspace-cli" # gws: official Google Workspace admin CLI
brew "glab" # GitLab CLI (prefer the GitLab MCP first; see CLAUDE.md)
cask "antigravity-cli"
cask "gcloud-cli"
cask "font-dejavu-sans-mono-nerd-font"
