tap "ttscoff/thelab" # Brett Terpstra's tap; home of the Marked 3 CLI (mk)
tap "jetbrains/utils" # JetBrains' tap; home of the Qodana CLI
brew "git" # real binary; bypasses the slow /usr/bin/git Xcode shim
brew "neovim"
brew "tmux"
brew "direnv"
brew "asdf"
brew "fzf"
brew "zoxide"
brew "bat"
brew "glow" # render markdown in the terminal
brew "ttscoff/thelab/mk" # Marked 3 CLI: `mk file.md` renders in the Marked.app preview window (needs Marked 3)
brew "eza"
brew "ripgrep"
brew "dotnet"
brew "powershell" # pwsh: cross-platform PowerShell (homebrew-core formula, not a cask)
brew "overmind"
brew "pnpm"
brew "googleworkspace-cli" # gws: official Google Workspace admin CLI
brew "glab" # GitLab CLI (prefer the GitLab MCP first; see CLAUDE.md)
brew "firebase-cli" # Firebase CLI (npm package is firebase-tools; homebrew-core names it firebase-cli)
brew "actionlint" # static checker for GitHub Actions workflows (pulls in shellcheck)
brew "jetbrains/utils/qodana" # Qodana CLI: JetBrains code-quality scanner (https://github.com/JetBrains/qodana-cli)
brew "bats-core" # ensemble plugin: bats test runner for the containment harness
brew "coreutils" # ensemble plugin: gtimeout — required hard-kill for the runaway-prone agy peer
cask "antigravity-cli"
cask "gcloud-cli"
cask "font-dejavu-sans-mono-nerd-font"
